In [1]:
import pandas as pd

In [3]:
data = pd.DataFrame({"Name": ["Anna", "John", "Maria", "Leo", "Sophie"],
    "Score": [78, 85, 92, 69, 88]})

In [5]:
data

     Name  Score
0    Anna     78
1    John     85
2   Maria     92
3     Leo     69
4  Sophie     88

In [7]:
# division
data['Score_div_10'] = data['Score'].apply(lambda x: x / 10)

In [9]:
data

     Name  Score  Score_div_10
0    Anna     78           7.8
1    John     85           8.5
2   Maria     92           9.2
3     Leo     69           6.9
4  Sophie     88           8.8

In [11]:
# multiplication
data['Score_x2'] = data['Score'].apply(lambda x: x * 2)

In [13]:
data

     Name  Score  Score_div_10  Score_x2
0    Anna     78           7.8       156
1    John     85           8.5       170
2   Maria     92           9.2       184
3     Leo     69           6.9       138
4  Sophie     88           8.8       176

In [15]:
# addition
data['Score_plus_5'] = data['Score'].apply(lambda x: x + 5)

In [17]:
data

     Name  Score  Score_div_10  Score_x2  Score_plus_5
0    Anna     78           7.8       156            83
1    John     85           8.5       170            90
2   Maria     92           9.2       184            97
3     Leo     69           6.9       138            74
4  Sophie     88           8.8       176            93

In [19]:
data['starts_with_A'] = data['Name'].apply(lambda x: x.startswith('A'))

In [21]:
data

     Name  Score  Score_div_10  Score_x2  Score_plus_5  starts_with_A
0    Anna     78           7.8       156            83           True
1    John     85           8.5       170            90          False
2   Maria     92           9.2       184            97          False
3     Leo     69           6.9       138            74          False
4  Sophie     88           8.8       176            93          False